OpenFOAM/OpenFOAM-2.2.x/tutorials/lagrangian/reactingParcelFilmFoam/hotBoxes/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    walls
    {
        type            wall;
        nFaces          44800;
        startFace       2226176;
    }
    region0_to_wallFilmRegion_cubeFaces
    {
        type            mappedWall;
        nFaces          6144;
        startFace       2270976;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_cubeFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
6144
(
(-0 -0 -0)
(-0 -2.775557562e-17 -0)
(5.551115123e-17 -2.775557562e-17 -0)
(-0 -1.387778781e-17 1.387778781e-17)
(-0 -2.775557562e-17 -0)
(-5.551115123e-17 -0 -0)
(-0 -2.775557562e-17 -0)
(-5.551115123e-17 -2.775557562e-17 -0)
...
)
;
    }
    region0_to_wallFilmRegion_floorFaces
    {
        type            mappedWall;
        nFaces          6400;
        startFace       2277120;
        sampleMode      nearestPatchFace;
        sampleRegion    wallFilmRegion;
        samplePatch     region0_to_wallFilmRegion_floorFaces;
        offsetMode      nonuniform;
        offsets         nonuniform List<vector> 
6400
(
(8.67361738e-19 -1.734723476e-18 -0)
(-0 -0 -0)
(-1.734723476e-18 -0 -0)
(8.67361738e-19 -6.938893904e-18 -0)
(-8.67361738e-19 -6.938893904e-18 -0)
(-8.67361738e-19 -1.387778781e-17 -0)
(-8.67361738e-19 -1.387778781e-17 -0)
(-0 -0 -0)
...
)
;
    }
)

// ************************************************************************* //
